jiangchiwu100/SmartTerminalUnit/FTU/bsp/stm32f429-apollo/applications/calculator/calculator.c
    S = sqrt(P * P + Q * Q);
    F = P / S;

    P = fabs(P) < g_Parameter[ZERODRIFT_P] ? 0 : P;
    Q = fabs(Q) < g_Parameter[ZERODRIFT_Q] ? 0 : Q;
    S = fabs(S) < g_Parameter[ZERODRIFT_S] ? 0 : S;

    g_TelemetryDB[g_TelemetryAddr.Uab]= Ua;
    g_TelemetryDB[g_TelemetryAddr.Ucb] = Uc;
    g_TelemetryDB[g_TelemetryAddr.Uac] = Ub;
    g_TelemetryDB[g_TelemetryAddr.U0] = U0;

    g_TelemetryDB[g_TelemetryAddr.UAB] = UA;
    g_TelemetryDB[g_TelemetryAddr.UCB] = UC;
    
    g_TelemetryDB[g_TelemetryAddr.Ia] = Ia;
    g_TelemetryDB[g_TelemetryAddr.Ib] = Ib;
    g_TelemetryDB[g_TelemetryAddr.Ic] = Ic;
    g_TelemetryDB[g_TelemetryAddr.I0] = I0;

    g_TelemetryDB[g_TelemetryAddr.P] = P;
    g_TelemetryDB[g_TelemetryAddr.Q] = Q;
    g_TelemetryDB[g_TelemetryAddr.S] = S;
    g_TelemetryDB[g_TelemetryAddr.PF] = F;

	g_TelemetryDB[g_TelemetryAddr.DC1] = Udc1;
	g_TelemetryDB[g_TelemetryAddr.DC2] = Udc2;
    
    g_TelemetryDB[g_TelemetryAddr.alphy_Uab_Ia] = g_Alpha[ALPHA_UabIa];
    g_TelemetryDB[g_TelemetryAddr.alphy_Ucb_Ic] = g_Alpha[ALPHA_UcbIc];
	
    if((g_TelemetryDB[g_TelemetryAddr.U0] == 0)||(g_TelemetryDB[g_TelemetryAddr.I0] == 0))
    {g_TelemetryDB[g_TelemetryAddr.alphy_U0_I0] = 0;}
    else       
    {
        while(g_Alpha[ALPHA_U0I0]<-180)
        {g_Alpha[ALPHA_U0I0] += 360;}
        while(g_Alpha[ALPHA_U0I0]>180)
        {g_Alpha[ALPHA_U0I0] -= 360;}
        g_TelemetryDB[g_TelemetryAddr.alphy_U0_I0] = g_Alpha[ALPHA_U0I0];
    }

    if((g_TelemetryDB[g_TelemetryAddr.Uab] == 0)||\
        (((g_Parameter[CFG_PRO_VOL_N] == 0)&&(g_TelemetryDB[g_TelemetryAddr.UAB] == 0))||\
        ((g_Parameter[CFG_PRO_VOL_N] == 1)&&(g_TelemetryDB[g_TelemetryAddr.UCB] == 0))))
    {g_TelemetryDB[g_TelemetryAddr.alphy_Ux_Ux] = 0;}
    else       
    {
        if(g_Alpha[ALPHA_UxUx]<-180)
        {g_Alpha[ALPHA_UxUx] += 360;}
        if(g_Alpha[ALPHA_UxUx]>180)
        {g_Alpha[ALPHA_UxUx] -= 360;}
        g_TelemetryDB[g_TelemetryAddr.alphy_Ux_Ux] = g_Alpha[ALPHA_UxUx];
    }
	
    g_TelemetryDB[g_TelemetryAddr.UabOnce] = Ua * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) / 1000.0f;
    g_TelemetryDB[g_TelemetryAddr.UbcOnce] = Uc * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) / 1000.0f;
    g_TelemetryDB[g_TelemetryAddr.UcaOnce] = Ub * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) / 1000.0f;
    g_TelemetryDB[g_TelemetryAddr.U0Once] = U0 * (g_Parameter[RATIO_U0_ONE_TURN] / g_Parameter[RATIO_U0_SECONDARY]) / 1000.0f;
    g_TelemetryDB[g_TelemetryAddr.UBCOnce] = UC * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) / 1000.0f;
    g_TelemetryDB[g_TelemetryAddr.UABOnce] = UA * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) / 1000.0f;
	
    g_TelemetryDB[g_TelemetryAddr.IaOnce] = Ia * (g_Parameter[RATIO_I_ONE_TURN] / g_Parameter[RATIO_I_SECONDARY]);
    g_TelemetryDB[g_TelemetryAddr.IbOnce] = Ib * (g_Parameter[RATIO_I_ONE_TURN] / g_Parameter[RATIO_I_SECONDARY]);    
    g_TelemetryDB[g_TelemetryAddr.IcOnce] = Ic * (g_Parameter[RATIO_I_ONE_TURN] / g_Parameter[RATIO_I_SECONDARY]);
    g_TelemetryDB[g_TelemetryAddr.I0Once] = I0 * (g_Parameter[RATIO_I0_ONE_TURN] / g_Parameter[RATIO_I0_SECONDARY]);

    g_TelemetryDB[g_TelemetryAddr.POnce] = P * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) * (g_Parameter[RATIO_I_ONE_TURN] / g_Parameter[RATIO_I_SECONDARY]);
    g_TelemetryDB[g_TelemetryAddr.QOnce] = Q * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) * (g_Parameter[RATIO_I_ONE_TURN] / g_Parameter[RATIO_I_SECONDARY]);
    g_TelemetryDB[g_TelemetryAddr.SOnce] = S * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) * (g_Parameter[RATIO_I_ONE_TURN] / g_Parameter[RATIO_I_SECONDARY]);

    if(g_Parameter[CFG_POW_VOL_AB] == 0)
    {
        if (Ua3 < g_Parameter[ZERODRIFT_Uab])Ua3 = 0;
        if (Ua5 < g_Parameter[ZERODRIFT_Uab])Ua5 = 0;
    }
    else
    {
        if (UA3 < g_Parameter[ZERODRIFT_Uab])UA3 = 0;
        if (UA5 < g_Parameter[ZERODRIFT_Uab])UA5 = 0;
    }

    if(g_Parameter[CFG_POW_VOL_CB] == 0)
    {
        if (Uc3 < g_Parameter[ZERODRIFT_Ucb])Uc3 = 0;
        if (Uc5 < g_Parameter[ZERODRIFT_Ucb])Uc5 = 0;
    }
    else
    {
        if (UC3 < g_Parameter[ZERODRIFT_Ucb])UC3 = 0;
        if (UC5 < g_Parameter[ZERODRIFT_Ucb])UC5 = 0;
    }
        
    if (Ub3 < g_Parameter[ZERODRIFT_Uac])Ub3 = 0;    
    if (U03 < g_Parameter[ZERODRIFT_U0]) U03 = 0;
    	
	if (Ia2 < g_Parameter[ZERODRIFT_Ia]) Ia2 = 0;
	if (Ib2 < g_Parameter[ZERODRIFT_Ib]) Ib2 = 0;
	if (Ic2 < g_Parameter[ZERODRIFT_Ic]) Ic2 = 0;
	
    if (Ia3 < g_Parameter[ZERODRIFT_Ia]) Ia3 = 0;
    if (Ib3 < g_Parameter[ZERODRIFT_Ib]) Ib3 = 0;
    if (Ic3 < g_Parameter[ZERODRIFT_Ic]) Ic3 = 0;
    if (I03 < g_Parameter[ZERODRIFT_I0]) I03 = 0;

    
    if (Ub5 < g_Parameter[ZERODRIFT_Uac])Ub5 = 0;    
    if (U05 < g_Parameter[ZERODRIFT_U0]) U05 = 0;
    if (Ia5 < g_Parameter[ZERODRIFT_Ia]) Ia5 = 0;
    if (Ib5 < g_Parameter[ZERODRIFT_Ib]) Ib5 = 0;
    if (Ic5 < g_Parameter[ZERODRIFT_Ic]) Ic5 = 0;
    if (I05 < g_Parameter[ZERODRIFT_I0]) I05 = 0;
    
    g_secondHarmonicIa = Ia2;
	g_secondHarmonicIb = Ib2;
	g_secondHarmonicIc = Ic2;

    if(g_Parameter[CFG_POW_VOL_AB] == 0)
    {
        g_TelemetryDB[g_TelemetryAddr.thirdharmonicUab] = Ua3; 
        g_TelemetryDB[g_TelemetryAddr.fifthharmonicUab] = Ua5;
    }
    else
    {
        g_TelemetryDB[g_TelemetryAddr.thirdharmonicUab] = UA3; 
        g_TelemetryDB[g_TelemetryAddr.fifthharmonicUab] = UA5;    
    }
    if(g_Parameter[CFG_POW_VOL_CB] == 0)
    {
        g_TelemetryDB[g_TelemetryAddr.thirdharmonicUbc] = Uc3;
        g_TelemetryDB[g_TelemetryAddr.fifthharmonicUbc] = Uc5;
    }
    else
    {
        g_TelemetryDB[g_TelemetryAddr.thirdharmonicUbc] = UC3;
        g_TelemetryDB[g_TelemetryAddr.fifthharmonicUbc] = UC5;    
    }
            
    g_TelemetryDB[g_TelemetryAddr.thirdharmonicUca] = Ub3;
    g_TelemetryDB[g_TelemetryAddr.thirdharmonicU0] = U03;
    g_TelemetryDB[g_TelemetryAddr.thirdharmonicIa] = Ia3;
    g_TelemetryDB[g_TelemetryAddr.thirdharmonicIb] = Ib3;
    g_TelemetryDB[g_TelemetryAddr.thirdharmonicIc] = Ic3;
    g_TelemetryDB[g_TelemetryAddr.thirdharmonicI0] = I03;
    
    g_TelemetryDB[g_TelemetryAddr.fifthharmonicUca] = Ub5;
    g_TelemetryDB[g_TelemetryAddr.fifthharmonicU0] = U05;
    g_TelemetryDB[g_TelemetryAddr.fifthharmonicIa] = Ia5;
    g_TelemetryDB[g_TelemetryAddr.fifthharmonicIb] = Ib5;
    g_TelemetryDB[g_TelemetryAddr.fifthharmonicIc] = Ic5;
    g_TelemetryDB[g_TelemetryAddr.fifthharmonicI0] = I05;
    
#if RT_USING_TELEMETRY_SET    
    for (i = 0; i < TELEMETRY_TOTAL_NUM; i++)
    {
        if (g_TelemetrySetEnable[i] == SWITCH_ON)
        {
            g_TelemetryDB[i] = g_TelemetrySetValue[i];
        }
    }
#endif /* RT_USING_TELEMETRY_SET */ 
}


/* PUBLIC FUNCTION PROTOTYPES ------------------------------------------------*/
/**
  * @Description: AD7606采样值初始化.
  * @param:  无
  * @return: 无
  */
int calculate_init(void)
{
    arm_cfft_radix2_init_f32(&Scfft, 32, 0, 1); // 初始化Scfft结构体
    	
    return(RT_EOK);     
}
INIT_BOARD_EXPORT(calculate_init);

/**
  * @Description: 计算任务.
  * @param:  无
  * @return: 无
  * @updata: [YYYY-MM-DD] [更改人姓名][变更描述]
  */
void CalcultateTask(void)
{
    CalculateData();

    /* 系数校准 */
    CalibrationFactorCal(g_CalibrateFactorCfg_Len);
}

/* END OF FILE ---------------------------------------------------------------*/
